app/views/owners/index.html.erb

SELECT COUNT(*) FROM "pets" WHERE "pets"."owner_id" = 7
SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" IN (1, 2, 3)
---
        <td><%= owner.phone %></td>
        <td><%= owner.pets.size %></td>