app/views/pets/_form.html.erb

    <%= f.label :owner_id, "Owner", class: "form-label" %>
    <%= f.collection_select :owner_id, Owner.all, :id, :first_name, { prompt: "Select owner" }, class: "form-select" %>
---
SELECT "owners".* FROM "owners"