app/views/pets/index.html.erb

        <td><%= pet.breed %></td>
        <td><%= pet.owner ? link_to("#{pet.owner.first_name} #{pet.owner.last_name}", owner_path(pet.owner)) : "No owner" %></td>
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" IN (1, 2, 3)