app/views/pets/show.html.erb

          <li class="list-group-item"><strong>Weight:</strong> <%= @pet.weight %> kg</li>
          <li class="list-group-item"><strong>Owner:</strong> <%= link_to "#{@pet.owner.first_name} #{@pet.owner.last_name}", owner_path(@pet.owner) %></li>
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = 2 LIMIT 1