app/policies/appointment_policy.rb

    def resolve
      if user.admin?
        scope.all
      elsif user.vet?
        vet = Vet.find_by(user_id: user.id)
---
SELECT "vets".* FROM "vets" WHERE "vets"."user_id" = 2 LIMIT 1