app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.includes(:pet, :vet).all
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."vet_id" = 1
SELECT "pets".* FROM "pets" WHERE "pets"."id" IN (6, 7, 8, 9, 10)
SELECT "vets".* FROM "vets" WHERE "vets"."id" IN (7, 8)

  def show
    @appointment = Appointment.includes(treatments: :rich_text_clinical_notes).find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 1 LIMIT 1

  def create
    @appointment = Appointment.new(appointment_params)
    if @appointment.save
---
INSERT INTO "appointments" ("created_at", "date", "pet_id", "reason", "status", "updated_at", "vet_id") VALUES ('2026-05-07 19:40:19.919813', '2026-05-23 15:39:00', 2, '<script>alert(1)</script>', 0, '2026-05-07 19:40:19.919813', 1) RETURNING "id"

  def update
    if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "reason" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["reason", "Updated reason"], ["updated_at", "2026-04-30 22:11:35.461835"], ["id", 1025211570]]