app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners"
SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" IN (10, 11, 12)
---
  def index
    @owners = Owner.includes(:pets).all

INSERT INTO "owners" ("address", "created_at", "email", "first_name", "last_name", "phone", "updated_at") VALUES ('universidad de los andes', '2026-04-30 22:00:13.283024', 'ella@email.com', 'Ella', 'be', '764619394791', '2026-04-30 22:00:13.283024') RETURNING "id"
---
  def create
    @owner = Owner.new(owner_params)
    if @owner.save

UPDATE "owners" SET "first_name" = $1, "updated_at" = $2 WHERE "owners"."id" = $3  [["first_name", "Updated"], ["updated_at", "2026-04-30 22:11:20.469690"], ["id", 755095536]]
---
  def update
    if @owner.update(owner_params)

DELETE FROM "owners" WHERE "owners"."id" = 4
---
  def destroy
    @owner.destroy

SELECT "owners".* FROM "owners" WHERE "owners"."id" = 4 LIMIT 1
---
  def set_owner
    @owner = Owner.find(params[:id])