app/controllers/pets_controller.rb

SELECT "owners".* FROM "owners" WHERE "owners"."id" IN (10, 11, 12)
SELECT "pets".* FROM "pets"
---
  def index
    @pets = Pet.includes(:owner).all

INSERT INTO "pets" ("breed", "created_at", "date_of_birth", "name", "owner_id", "species", "updated_at", "weight") VALUES ('Fox terrier', '2026-04-30 22:00:48.750723', '2026-04-01', 'Memo', 4, 'dog', '2026-04-30 22:00:48.750723', 3.0) RETURNING "id"
---
  def create
    @pet = Pet.new(pet_params)
    if @pet.save

UPDATE "pets" SET "name" = $1, "updated_at" = $2 WHERE "pets"."id" = $3  [["name", "Updated"], ["updated_at", "2026-04-30 22:11:35.347972"], ["id", 494281355]]
---
  def update
    if @pet.update(pet_params)

DELETE FROM "pets" WHERE "pets"."id" = 6
---
  def destroy
    @pet.destroy