app/controllers/treatments_controller.rb

INSERT INTO "treatments" ("administered_at", "appointment_id", "created_at", "dosage", "medication", "name", "updated_at") VALUES ('2026-05-08 15:36:00', 5, '2026-05-07 19:36:42.651449', '10', 'non', '<script>alert(1)</script>', '2026-05-07 19:36:42.651449') RETURNING "id"
---
  def create
    @treatment = @appointment.treatments.build(treatment_params)
    if @treatment.save

UPDATE "treatments" SET "updated_at" = '2026-05-07 23:34:18.712523' WHERE "treatments"."id" = 7
---
  def update
    if @treatment.update(treatment_params)

DELETE FROM "treatments" WHERE "treatments"."id" = 6
---
  def destroy
    @treatment.destroy

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 1 LIMIT 1
---
  def set_appointment
    @appointment = Appointment.find(params[:appointment_id])

SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" = 1 AND "treatments"."id" = 6 LIMIT 1
---
  def set_treatment
    @treatment = @appointment.treatments.find(params[:id])