app/controllers/vets_controller.rb

  def index
    @vets = Vet.all
---
SELECT "vets".* FROM "vets"

  def create
    @vet = Vet.new(vet_params)
    if @vet.save
---
INSERT INTO "vets" ("created_at", "email", "first_name", "last_name", "phone", "specialization", "updated_at") VALUES ('2026-04-30 22:02:03.651100', 'adijsf@email.com', 'nadie', 'don', '18379874', 'surgery', '2026-04-30 22:02:03.651100') RETURNING "id"

  def update
    if @vet.update(vet_params)
---
UPDATE "vets" SET "specialization" = $1, "updated_at" = $2 WHERE "vets"."id" = $3  [["specialization", "Surgery"], ["updated_at", "2026-04-30 22:11:35.436571"], ["id", 933195747]]

  def destroy
    @vet.destroy
---
DELETE FROM "vets" WHERE "vets"."id" = 3

  def set_vet
    @vet = Vet.find(params[:id])
---
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 3 LIMIT 1