app/views/appointments/_form.html.erb

SELECT "pets".* FROM "pets"
---
    <%= f.label :pet_id, "Pet", class: "form-label" %>
    <%= f.collection_select :pet_id, Pet.all, :id, :name, { prompt: "Select pet" }, class: "form-select" %>

SELECT "vets".* FROM "vets"
---
    <%= f.label :vet_id, "Veterinarian", class: "form-label" %>
    <%= f.collection_select :vet_id, Vet.all, :id, :first_name, { prompt: "Select vet" }, class: "form-select" %>