app/views/appointments/show.html.erb

SELECT "vets".* FROM "vets" WHERE "vets"."id" = 3 LIMIT 1
---
    <li class="list-group-item"><strong>Pet:</strong> <%= link_to @appointment.pet.name, pet_path(@appointment.pet) %></li>
    <li class="list-group-item"><strong>Vet:</strong> <%= link_to "#{@appointment.vet.first_name} #{@appointment.vet.last_name}", vet_path(@appointment.vet) %></li>

SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" = 1
SELECT 1 AS one FROM "treatments" WHERE "treatments"."appointment_id" = 6 LIMIT 1
---

<% if @appointment.treatments.any? %>
  <% @appointment.treatments.each do |treatment| %>