app/views/layouts/_navbar.html.erb

SELECT "owners".* FROM "owners" WHERE "owners"."user_id" = 4 LIMIT 1
---
          <% elsif current_user.owner? %>
            <% owner = Owner.find_by(user_id: current_user.id) %>